In [1]:
import pandas as pd
import numpy as np
import psycopg2
import query_maker
np.random.seed(42)
# exams = pd.read_csv('exams.csv')
tb_city = pd.read_csv('db/City.csv')
tb_country = pd.read_csv('db/Country.csv')

In [2]:
# print(exams.head(1))
# print(exams.columns)
print(tb_city.columns)
print(tb_country.columns)

Index(['id', 'country_code', 'population'], dtype='object')
Index(['code', 'surface_area', 'indep_year', 'population', 'life_expectancy',
       'gnp', 'gnp_old', 'capital'],
      dtype='object')

In [3]:
# exams.drop(['gender', 'race/ethnicity', 'parental level of education', 'lunch', 'test preparation course'], axis=1, inplace=True)

In [4]:
# Use an external config.py file instead to store the credentials
import config
print(config.hostname)

# Copy this (or something similar) into config.py:
# hostname = 'localhost'
# database = 'postgres'
# username = 'postgres'
# pwd = None # need to add this
# port_id = 5433

localhost

In [5]:
tables = [tb_city, tb_country]
table_names = ['city', 'country']
cols_names = ['id', 'population', 'surface_area', 'indep_year', 'population', 
       'life_expectancy','gnp', 'gnp_old', 'capital']

In [6]:
sqlQuery, vectorQuery = query_maker.generate_queries(tables, 
                                                     table_names,n=20000, 
                                                     max_nr_preds = 2, 
                                                     cols_names=cols_names)

In [7]:
plan_results = []
actual_results = []

In [8]:
try:
  # need to download postgres and supply your own info 
  # with password and stuff
  connection = psycopg2.connect(host = config.hostname,
                                dbname = config.database,
                                user = config.username,
                                password = config.pwd,
                                port = config.port_id)

  cur = connection.cursor()

  for query in sqlQuery:
    cur.execute('explain (format json, analyze) ' + query)
    result = cur.fetchone()[0][0]
    plan_results.append(result['Plan']['Plan Rows'])
    actual_results.append(result['Plan']['Actual Rows'])

except Exception as error:
  print(error)
finally:
  if cur:
    cur.close()
  if connection:
    connection.close()

In [9]:
plan_results

[1,
 1,
 1,
 1229,
 693,
 6,
 32,
 4078,
 13,
 2889,
 111,
 101,
 230,
 3942,
 819,
 444,
 3942,
 4068,
 174,
 3021,
 167,
 1,
 2,
 55,
 4078,
 17,
 4078,
 4078,
 3874,
 2,
 3721,
 1060,
 1,
 1399,
 102,
 34,
 1,
 4054,
 33,
 17,
 85,
 160,
 1,
 1626,
 1,
 205,
 177,
 160,
 17,
 1,
 3980,
 20,
 1,
 67,
 1,
 1,
 17,
 2634,
 17,
 2194,
 3874,
 4060,
 17,
 1,
 4078,
 3942,
 798,
 17,
 37,
 3021,
 1,
 1,
 177,
 89,
 17,
 17,
 222,
 4051,
 2,
 3942,
 3843,
 4078,
 95,
 2543,
 3021,
 234,
 30,
 39,
 17,
 2999,
 90,
 4055,
 1119,
 3448,
 4042,
 2400,
 177,
 4078,
 1,
 4076,
 2987,
 495,
 17,
 17,
 1,
 2887,
 4075,
 2082,
 4043,
 4008,
 4058,
 45,
 3021,
 178,
 25,
 3021,
 23,
 1297,
 178,
 1,
 3016,
 4079,
 74,
 495,
 4072,
 4059,
 90,
 222,
 256,
 3603,
 754,
 1724,
 2120,
 4078,
 1,
 38,
 2827,
 567,
 2529,
 4078,
 1,
 3942,
 2987,
 3567,
 85,
 3021,
 1571,
 3021,
 3884,
 3021,
 137,
 1,
 4078,
 2152,
 4078,
 4078,
 713,
 3150,
 176,
 17,
 461,
 17,
 3021,
 1,
 991,
 17,
 1,
 3943,
 99,
 3021,
 1,
 343,
 177,
 2560,
 2702,
 29,
 74,
 2731,
 1237,
 4078,
 176,
 178,
 4078,
 3021,
 4078,
 4078,
 151,
 4,
 17,
 37,
 51,
 4078,
 1,
 3755,
 4078,
 4004,
 12,
 119,
 4067,
 4063,
 4078,
 231,
 3038,
 17,
 138,
 1587,
 1,
 2219,
 4066,
 1254,
 4078,
 478,
 177,
 4078,
 1,
 202,
 3243,
 231,
 3408,
 2,
 1,
 1,
 141,
 51,
 3021,
 3,
 1,
 17,
 160,
 1741,
 221,
 51,
 2782,
 188,
 1,
 3021,
 4079,
 1,
 3209,
 2936,
 229,
 1,
 2874,
 176,
 18,
 4073,
 1,
 4078,
 133,
 2748,
 17,
 4052,
 1,
 3038,
 1,
 1,
 171,
 3660,
 4050,
 2771,
 1365,
 47,
 4079,
 1,
 1451,
 3021,
 3004,
 27,
 4078,
 3038,
 4075,
 29,
 3021,
 719,
 3904,
 4073,
 4078,
 3942,
 1,
 207,
 223,
 17,
 177,
 2102,
 1,
 1,
 26,
 3038,
 3750,
 2738,
 3021,
 4071,
 174,
 17,
 3951,
 1148,
 17,
 164,
 6,
 3,
 1,
 4041,
 170,
 4054,
 17,
 1,
 177,
 15,
 4064,
 1166,
 3704,
 1081,
 117,
 17,
 3371,
 1,
 3,
 131,
 16,
 4079,
 2166,
 1,
 17,
 94,
 4007,
 1,
 2628,
 1,
 3942,
 4079,
 2941,
 4078,
 4040,
 4078,
 2,
 354,
 3964,
 4069,
 2403,
 3021,
 1,
 71,
 9,
 3,
 20,
 150,
 236,
 4050,
 1,
 3781,
 59,
 2205,
 231,
 4063,
 1,
 2936,
 6,
 231,
 177,
 960,
 14,
 4078,
 81,
 3004,
 3021,
 4078,
 3021,
 3979,
 1,
 4077,
 34,
 34,
 341,
 4078,
 256,
 34,
 1,
 29,
 160,
 3942,
 1,
 17,
 306,
 3021,
 4028,
 177,
 176,
 4052,
 3854,
 1,
 2141,
 3177,
 4016,
 7,
 2782,
 17,
 6,
 1,
 175,
 3592,
 1178,
 2662,
 4078,
 4078,
 4078,
 3021,
 3921,
 4078,
 183,
 139,
 2423,
 3942,
 4023,
 3901,
 1,
 1655,
 4078,
 1,
 172,
 3004,
 4079,
 2474,
 3243,
 17,
 81,
 4078,
 802,
 325,
 176,
 4063,
 3942,
 1195,
 2711,
 68,
 4065,
 4079,
 1178,
 3866,
 3942,
 4070,
 17,
 2,
 3759,
 177,
 34,
 1,
 3925,
 162,
 35,
 236,
 3004,
 4078,
 9,
 2560,
 666,
 1,
 217,
 2168,
 17,
 98,
 31,
 1,
 254,
 1,
 4078,
 2157,
 177,
 2,
 1,
 171,
 3004,
 1417,
 1494,
 3942,
 2936,
 2493,
 3423,
 1707,
 17,
 34,
 17,
 1,
 3021,
 4052,
 4078,
 3942,
 4078,
 200,
 239,
 3021,
 1,
 1365,
 4078,
 38,
 3772,
 5,
 154,
 102,
 201,
 17,
 4040,
 3004,
 1,
 4078,
 478,
 6,
 1,
 1,
 2987,
 4044,
 3872,
 2010,
 2386,
 1636,
 131,
 17,
 93,
 1839,
 4,
 17,
 2321,
 177,
 3,
 3806,
 3897,
 2,
 4078,
 1382,
 1,
 27,
 19,
 1417,
 113,
 117,
 1042,
 119,
 232,
 3089,
 1928,
 34,
 196,
 3021,
 1,
 3021,
 1,
 1054,
 178,
 2372,
 1,
 51,
 173,
 211,
 3004,
 1,
 1,
 3942,
 4066,
 2085,
 2765,
 787,
 4065,
 11,
 3942,
 69,
 135,
 178,
 1,
 17,
 17,
 34,
 3114,
 231,
 38,
 68,
 51,
 2799,
 231,
 3584,
 5,
 17,
 3925,
 3004,
 1,
 4043,
 1172,
 3738,
 3942,
 185,
 139,
 15,
 183,
 4078,
 3527,
 177,
 1297,
 4059,
 4078,
 3119,
 2902,
 130,
 4032,
 3992,
 17,
 3021,
 1,
 1,
 3465,
 1,
 1,
 1,
 34,
 1,
 17,
 193,
 4078,
 3942,
 1,
 4001,
 4079,
 17,
 125,
 1621,
 2765,
 222,
 1297,
 1,
 71,
 231,
 1,
 4078,
 949,
 3465,
 3235,
 177,
 2935,
 3465,
 17,
 204,
 2270,
 177,
 177,
 2,
 3021,
 15,
 1,
 4078,
 51,
 4078,
 174,
 177,
 1020,
 1,
 2748,
 76,
 17,
 3021,
 1,
 34,
 165,
 4078,
 3,
 1,
 3212,
 3038,
 998,
 1,
 4047,
 171,
 2867,
 1728,
 178,
 4061,
 1604,
 22,
 4058,
 32,
 3942,
 1,
 72,
 3877,
 1290,
 3021,
 4078,
 4078,
 4078,
 1999,
 4078,
 712,
 1,
 58,
 290,
 17,
 1,
 273,
 3004,
 1611,
 2269,
 2,
 2249,
 4065,
 3942,
 176,
 17,
 4077,
 131,
 1,
 1,
 2611,
 3311,
 3771,
 1,
 17,
 152,
 132,
 1,
 85,
 2568,
 2212,
 1,
 4056,
 3021,
 9,
 3055,
 55,
 85,
 1,
 3537,
 1,
 36,
 3199,
 177,
 173,
 1,
 3942,
 85,
 1,
 1,
 1120,
 77,
 180,
 3482,
 1,
 2092,
 4018,
 3942,
 1621,
 1,
 1118,
 178,
 4078,
 4078,
 3942,
 3942,
 2031,
 178,
 161,
 1884,
 3942,
 4078,
 2436,
 23,
 17,
 21,
 2222,
 1125,
 3,
 2763,
 4078,
 223,
 2258,
 610,
 3539,
 1002,
 4078,
 1,
 4078,
 176,
 4078,
 231,
 3340,
 3942,
 16,
 17,
 177,
 4068,
 2019,
 3623,
 502,
 1,
 1874,
 1229,
 3757,
 3021,
 17,
 2577,
 75,
 2504,
 102,
 906,
 1690,
 2747,
 4079,
 4054,
 141,
 4079,
 1,
 515,
 6,
 17,
 1,
 177,
 3209,
 1296,
 4073,
 231,
 29,
 4070,
 29,
 17,
 3840,
 3021,
 2403,
 1,
 1,
 1,
 853,
 4068,
 2901,
 28,
 1,
 699,
 551,
 1270,
 4078,
 17,
 1,
 230,
 27,
 11,
 4078,
 1,
 39,
 4079,
 1,
 4078,
 1,
 185,
 1382,
 2560,
 204,
 177,
 4078,
 178,
 211,
 3038,
 1,
 212,
 4078,
 1,
 1,
 4066,
 87,
 840,
 1,
 3738,
 17,
 202,
 1,
 2606,
 4078,
 3021,
 1597,
 231,
 221,
 3417,
 1604,
 17,
 2,
 4079,
 177,
 28,
 2008,
 1,
 177,
 3004,
 2159,
 4078,
 3942,
 3021,
 2,
 1,
 3014,
 3874,
 3010,
 2689,
 1,
 4077,
 2552,
 4078,
 1,
 390,
 1236,
 173,
 1,
 2577,
 4078,
 905,
 563,
 4078,
 2936,
 83,
 2,
 3969,
 2099,
 4078,
 231,
 80,
 1,
 4049,
 1,
 2720,
 3021,
 46,
 3942,
 1,
 4064,
 4044,
 4078,
 150,
 832,
 1,
 72,
 3021,
 133,
 2808,
 816,
 4078,
 1,
 4072,
 85,
 5,
 1,
 1,
 3004,
 3942,
 673,
 17,
 3021,
 223,
 17,
 273,
 1,
 1,
 139,
 4030,
 4027,
 467,
 4078,
 1,
 3823,
 102,
 17,
 1629,
 3482,
 196,
 4055,
 4078,
 1,
 2,
 17,
 1,
 1,
 1356,
 3021,
 3021,
 4047,
 4078,
 17,
 1,
 1,
 3067,
 1069,
 13,
 2186,
 2,
 1,
 1,
 3942,
 2748,
 176,
 175,
 2873,
 17,
 2,
 17,
 3482,
 1,
 223,
 3004,
 4047,
 ...]

In [10]:
sqlQuery

['SELECT * FROM country WHERE country.gnp_old = 1692900',
 'SELECT * FROM city WHERE city.population = 9958656',
 'SELECT * FROM city WHERE city.id = 3381 AND city.population != 4981547',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 1216',
 'SELECT * FROM city, country WHERE country_code = code AND city.id >= 3386',
 'SELECT * FROM city, country WHERE country_code = code AND city.population > 9305690',
 'SELECT * FROM city WHERE city.population >= 4721381',
 'SELECT * FROM city, country WHERE country_code = code AND city.population != 84696',
 'SELECT * FROM city, country WHERE country_code = code AND city.population >= 8242722',
 'SELECT * FROM city WHERE city.id <= 2889',
 'SELECT * FROM country WHERE country.gnp_old != 2795670 AND country.capital < 2825',
 'SELECT * FROM country WHERE country.capital >= 2557 OR country.gnp_old >= 4998052',
 'SELECT * FROM country WHERE country.capital < 3944',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital != 2614',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital <= 703',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 202',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital != 3799',
 'SELECT * FROM city, country WHERE country_code = code AND city.population <= 8411897',
 'SELECT * FROM country WHERE country.gnp_old < 1767797',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital <= 3113',
 'SELECT * FROM city WHERE city.id > 3911',
 'SELECT * FROM country WHERE country.capital = 1523',
 'SELECT * FROM country WHERE country.gnp_old > 2109975',
 'SELECT * FROM country WHERE country.capital > 3100',
 'SELECT * FROM city WHERE city.population > 4142849 OR city.population != 7988046',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 1571',
 'SELECT * FROM city WHERE city.id != 2691',
 'SELECT * FROM city WHERE city.id != 393 OR city.id = 207',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital <= 3763',
 'SELECT * FROM country WHERE country.gnp_old >= 3331225',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital <= 3479',
 'SELECT * FROM city WHERE city.id <= 1060',
 'SELECT * FROM country WHERE country.gnp_old = 4574450',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital <= 1598',
 'SELECT * FROM city WHERE city.population >= 8306503 OR city.population >= 2009063',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old >= 3561077',
 'SELECT * FROM country WHERE country.gnp_old > 5178807',
 'SELECT * FROM city, country WHERE country_code = code AND city.population <= 5822226',
 'SELECT * FROM city WHERE city.population > 4422922 AND city.id != 3891',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old = 4025874',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital > 3764',
 'SELECT * FROM country WHERE country.capital >= 1292',
 'SELECT * FROM city, country WHERE country_code = code AND city.population = 416922',
 'SELECT * FROM city WHERE city.id > 642 AND city.id < 2268',
 'SELECT * FROM city WHERE city.id = 1154 AND city.id != 1077',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital >= 3511',
 'SELECT * FROM country WHERE country.gnp_old != 2558388',
 'SELECT * FROM country WHERE country.capital = 3273 OR country.capital > 1148',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old = 4506416',
 'SELECT * FROM city, country WHERE country_code = code AND city.population = 910723',
 'SELECT * FROM city WHERE city.population >= 71337',
 'SELECT * FROM country WHERE country.gnp_old >= 825973 OR country.gnp_old > 374862',
 'SELECT * FROM country WHERE country.gnp_old >= 7299852 AND country.gnp_old < 2204821',
 'SELECT * FROM city, country WHERE country_code = code AND city.population > 2472231',
 'SELECT * FROM city, country WHERE country_code = code AND city.id = 3063',
 'SELECT * FROM city WHERE city.id = 404',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital > 3992',
 'SELECT * FROM city, country WHERE country_code = code AND city.id >= 1446',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 3184',
 'SELECT * FROM city, country WHERE country_code = code AND city.id > 1885',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 3778',
 'SELECT * FROM city, country WHERE country_code = code AND city.population <= 6928082',
 'SELECT * FROM city, country WHERE country_code = code AND city.population > 7328183',
 'SELECT * FROM country WHERE country.capital = 640 AND country.capital > 3105',
 'SELECT * FROM city, country WHERE country_code = code AND city.id != 3447',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital != 2278',
 'SELECT * FROM city WHERE city.population = 10403134 OR city.id < 798',
 'SELECT * FROM city, country WHERE country_code = code AND city.population > 7265837',
 'SELECT * FROM country WHERE country.capital > 3244',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 3444241',
 'SELECT * FROM city, country WHERE country_code = code AND city.population > 10320410',
 'SELECT * FROM city, country WHERE country_code = code AND city.id = 700',
 'SELECT * FROM country WHERE country.gnp_old <= 6261820',
 'SELECT * FROM city WHERE city.id < 4074 AND city.population > 1989215',
 'SELECT * FROM country WHERE country.capital != 3711 AND country.capital < 155',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old > 7970341',
 'SELECT * FROM country WHERE country.gnp_old < 6526975 OR country.gnp_old < 1492942',
 'SELECT * FROM city, country WHERE country_code = code AND city.population < 5491632',
 'SELECT * FROM country WHERE country.capital > 3848',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital != 972',
 'SELECT * FROM city WHERE city.population < 996203',
 'SELECT * FROM city, country WHERE country_code = code AND city.id != 51',
 'SELECT * FROM country WHERE country.capital <= 2198',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital > 1716',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 461400',
 'SELECT * FROM city WHERE city.id >= 5 AND city.population >= 1004688',
 'SELECT * FROM city, country WHERE country_code = code AND city.population >= 5143943',
 'SELECT * FROM city WHERE city.population >= 3379611',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 657',
 'SELECT * FROM city, country WHERE country_code = code AND city.id >= 1082',
 'SELECT * FROM country WHERE country.capital <= 1854',
 'SELECT * FROM city WHERE city.population <= 6095971',
 'SELECT * FROM city, country WHERE country_code = code AND city.id < 1120',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital > 488',
 'SELECT * FROM city WHERE city.population <= 3699433',
 'SELECT * FROM city WHERE city.id = 154 OR city.id >= 1680',
 'SELECT * FROM country WHERE country.gnp_old != 9592',
 'SELECT * FROM city WHERE city.population != 2288669',
 'SELECT * FROM country WHERE country.capital <= 1313 AND country.capital >= 3326',
 'SELECT * FROM city WHERE city.population <= 10029899 OR city.population >= 3693347',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old <= 1589385',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 497',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 852',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 2428',
 'SELECT * FROM city WHERE city.id = 1637',
 'SELECT * FROM city, country WHERE country_code = code AND city.id > 1192',
 'SELECT * FROM city, country WHERE country_code = code AND city.population <= 9702743',
 'SELECT * FROM city, country WHERE country_code = code AND city.id < 2083',
 'SELECT * FROM city WHERE city.population < 3353639 OR city.id < 418',
 'SELECT * FROM city WHERE city.population < 531873 OR city.id <= 3492',
 'SELECT * FROM city WHERE city.population < 6854542',
 'SELECT * FROM country WHERE country.gnp_old = 3970158 OR country.gnp_old >= 70797',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 5668732',
 'SELECT * FROM country WHERE country.gnp_old <= 6990259',
 'SELECT * FROM city WHERE city.population > 5781607',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 3265065',
 'SELECT * FROM city WHERE city.population >= 6486502',
 'SELECT * FROM city WHERE city.id >= 2783 AND city.id != 3456',
 'SELECT * FROM country WHERE country.capital <= 3141',
 'SELECT * FROM country WHERE country.capital = 1493',
 'SELECT * FROM city, country WHERE country_code = code AND city.id > 1063',
 'SELECT * FROM city WHERE city.population != 533678 OR city.id < 3235',
 'SELECT * FROM city WHERE city.population >= 2276402',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital > 3325',
 'SELECT * FROM city, country WHERE country_code = code AND city.population <= 9106866',
 'SELECT * FROM city, country WHERE country_code = code AND city.population < 6903878',
 'SELECT * FROM country WHERE country.capital <= 1857',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old > 394697',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital >= 3487',
 'SELECT * FROM city WHERE city.population = 448387 OR city.id < 3603',
 'SELECT * FROM city, country WHERE country_code = code AND city.id <= 754',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital >= 2524',
 'SELECT * FROM city, country WHERE country_code = code AND city.id > 1959',
 'SELECT * FROM city WHERE city.population != 7668258',
 'SELECT * FROM country WHERE country.gnp_old > 4035650',
 'SELECT * FROM country WHERE country.capital <= 815 AND country.gnp_old <= 2225457',
 'SELECT * FROM city, country WHERE country_code = code AND city.id >= 1253',
 'SELECT * FROM city, country WHERE country_code = code AND city.id >= 3513',
 'SELECT * FROM city, country WHERE country_code = code AND city.id > 1550',
 'SELECT * FROM city WHERE city.id != 3958',
 'SELECT * FROM country WHERE country.gnp_old = 7156904',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital != 3020',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old < 2668024',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 3388',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital <= 41',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 4578395',
 'SELECT * FROM city WHERE city.id >= 2509',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old <= 3311306',
 'SELECT * FROM city WHERE city.population <= 1178091 AND city.id > 10',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old <= 3314849',
 'SELECT * FROM country WHERE country.capital > 2194',
 'SELECT * FROM city, country WHERE country_code = code AND city.id = 853',
 'SELECT * FROM city, country WHERE country_code = code AND city.id != 2875',
 'SELECT * FROM city WHERE city.id < 2153',
 'SELECT * FROM city WHERE city.id != 476',
 'SELECT * FROM city WHERE city.id != 2819',
 'SELECT * FROM city WHERE city.id <= 714',
 'SELECT * FROM city, country WHERE country_code = code AND city.id <= 3150',
 'SELECT * FROM country WHERE country.gnp_old <= 3031913',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old > 4895364',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 250',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 3963',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 5054856',
 'SELECT * FROM country WHERE country.gnp_old > 5020657 AND country.gnp_old <= 2961450',
 'SELECT * FROM city WHERE city.population >= 317579',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old = 4975183',
 'SELECT * FROM country WHERE country.gnp_old > 4657850 AND country.capital >= 759',
 'SELECT * FROM city WHERE city.id >= 138',
 'SELECT * FROM city, country WHERE country_code = code AND city.population > 1855013',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old < 7151522',
 'SELECT * FROM country WHERE country.capital = 43',
 'SELECT * FROM city, country WHERE country_code = code AND city.id > 3735',
 'SELECT * FROM country WHERE country.gnp_old != 1726508',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital >= 1720',
 'SELECT * FROM city WHERE city.id <= 61 OR city.id < 2682',
 'SELECT * FROM city WHERE city.population >= 5279590',
 'SELECT * FROM city, country WHERE country_code = code AND city.population > 2245173',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital > 1102',
 'SELECT * FROM city, country WHERE country_code = code AND city.id > 2842',
 'SELECT * FROM city WHERE city.population != 3125396',
 'SELECT * FROM country WHERE country.gnp_old < 4783040',
 'SELECT * FROM country WHERE country.gnp_old <= 8083280',
 'SELECT * FROM city WHERE city.population != 7479863',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 6860148',
 'SELECT * FROM city, country WHERE country_code = code AND city.population != 10466657',
 'SELECT * FROM city WHERE city.id != 2411',
 'SELECT * FROM country WHERE country.capital < 2854',
 'SELECT * FROM city WHERE city.population > 9810446',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old > 3720621',
 'SELECT * FROM country WHERE country.capital > 3597 OR country.capital > 3284',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old > 1698057',
 'SELECT * FROM city, country WHERE country_code = code AND city.population != 3881035',
 'SELECT * FROM country WHERE country.gnp_old = 2460229 AND country.capital < 2661',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 3515',
 'SELECT * FROM city, country WHERE country_code = code AND city.id != 3813',
 'SELECT * FROM city WHERE city.population <= 2213615',
 'SELECT * FROM city, country WHERE country_code = code AND city.population >= 8375783',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old > 668563',
 'SELECT * FROM city WHERE city.population <= 8202829',
 'SELECT * FROM city, country WHERE country_code = code AND city.population < 7643645',
 'SELECT * FROM city, country WHERE country_code = code AND city.population != 10354847',
 'SELECT * FROM country WHERE country.capital != 194 OR country.gnp_old > 525291',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old <= 6429154',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 724',
 'SELECT * FROM country WHERE country.capital > 2138',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital <= 1918',
 'SELECT * FROM city WHERE city.id = 902 AND city.id > 690',
 'SELECT * FROM city, country WHERE country_code = code AND city.id < 2220',
 'SELECT * FROM city, country WHERE country_code = code AND city.population < 8291965',
 'SELECT * FROM city WHERE city.id > 2825',
 'SELECT * FROM city WHERE city.population = 5285000 OR city.id != 3889',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 334',
 'SELECT * FROM country WHERE country.gnp_old < 6638312',
 'SELECT * FROM city WHERE city.population != 5238373',
 'SELECT * FROM city, country WHERE country_code = code AND city.population = 9872274',
 'SELECT * FROM country WHERE country.capital <= 2053 OR country.gnp_old <= 5655535',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital >= 601',
 'SELECT * FROM country WHERE country.capital != 2848',
 'SELECT * FROM city WHERE city.id > 2193 OR city.id > 1249',
 'SELECT * FROM country WHERE country.gnp_old = 7905634 OR country.capital = 1670',
 'SELECT * FROM city WHERE city.population >= 9496605 AND city.population <= 6867142',
 'SELECT * FROM city WHERE city.id = 951',
 'SELECT * FROM country WHERE country.capital < 1659 OR country.capital <= 1866',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old >= 2300276',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old <= 3428132',
 'SELECT * FROM city WHERE city.population >= 10096342',
 'SELECT * FROM city, country WHERE country_code = code AND city.id = 2803',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 3355',
 'SELECT * FROM country WHERE country.capital < 2920',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital < 2350',
 'SELECT * FROM country WHERE country.gnp_old != 541813 OR country.capital < 3041',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old >= 2792584',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital <= 2936',
 'SELECT * FROM country WHERE country.capital > 604',
 'SELECT * FROM country WHERE country.capital = 3101',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 2276263',
 'SELECT * FROM city WHERE city.id < 2468 OR city.id != 1206',
 'SELECT * FROM city WHERE city.population = 6149073',
 'SELECT * FROM city WHERE city.id <= 3209',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old <= 884534',
 'SELECT * FROM city WHERE city.population > 1017475',
 'SELECT * FROM country WHERE country.gnp_old = 2087415 AND country.capital < 3601',
 'SELECT * FROM city WHERE city.id != 1991 AND city.id > 1204',
 'SELECT * FROM country WHERE country.gnp_old <= 2191579',
 'SELECT * FROM country WHERE country.capital <= 967 AND country.capital > 849',
 'SELECT * FROM city WHERE city.population >= 3732881 OR city.population <= 9427546',
 'SELECT * FROM country WHERE country.capital = 3963',
 'SELECT * FROM city, country WHERE country_code = code AND city.population != 5984726',
 'SELECT * FROM country WHERE country.capital < 2638 OR country.gnp_old > 5019151',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital >= 1137',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital = 831',
 'SELECT * FROM city, country WHERE country_code = code AND city.population <= 5517408',
 'SELECT * FROM city WHERE city.population = 8370304 AND city.population != 10174560',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old <= 7449764',
 'SELECT * FROM city WHERE city.id = 1791',
 'SELECT * FROM country WHERE country.gnp_old <= 3185871 AND country.gnp_old = 1728253',
 'SELECT * FROM country WHERE country.gnp_old != 608903 AND country.capital != 3984',
 'SELECT * FROM city, country WHERE country_code = code AND city.population <= 611255',
 'SELECT * FROM city WHERE city.population < 3672256 OR city.id > 3157',
 'SELECT * FROM city, country WHERE country_code = code AND city.id >= 1309',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital > 2863',
 'SELECT * FROM country WHERE country.capital < 707',
 'SELECT * FROM city WHERE city.population <= 1705257 OR city.id != 1758',
 'SELECT * FROM city, country WHERE country_code = code AND city.population = 8121891',
 'SELECT * FROM city, country WHERE country_code = code AND country.capital > 2762',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old != 1556339',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old < 4230415',
 'SELECT * FROM country WHERE country.capital < 237',
 'SELECT * FROM city WHERE city.population != 116781',
 'SELECT * FROM city, country WHERE country_code = code AND country.gnp_old <= 7596798',

In [13]:
vectorQuery_df = pd.DataFrame(vectorQuery)
vectorQuery_df['actual_cardinality'] = actual_results
vectorQuery_df['postgres_cardinality'] = plan_results
vectorQuery_df['sql_query'] = sqlQuery
vectorQuery_df

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,actual_cardinality,postgres_cardinality,sql_query
0,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,SELECT * FROM country WHERE country.gnp_old = ...
1,0,1,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,SELECT * FROM city WHERE city.population = 995...
2,0,1,0,1,0,0,0,0,0,0,...,0,0,0,0,0,1,4981547,1,1,SELECT * FROM city WHERE city.id = 3381 AND ci...
3,1,1,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1364,1229,"SELECT * FROM city, country WHERE country_code..."
4,1,1,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,694,693,"SELECT * FROM city, country WHERE country_code..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19995,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,232,231,SELECT * FROM country WHERE country.capital !=...
19996,1,1,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,3209,2970,"SELECT * FROM city, country WHERE country_code..."
19997,0,0,1,0,0,0,0,0,0,0,...,1,0,0,0,0,0,3053,48,47,SELECT * FROM country WHERE country.capital < ...
19998,0,1,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,37,38,SELECT * FROM city WHERE city.population >= 36...
19999,1,1,1,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,4079,4078,"SELECT * FROM city, country WHERE country_code..."

In [14]:
vectorQuery_df.to_csv('vectorizedQueries.csv')